step_5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>PCB Programming Challenges</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">PCB Programming Challenges</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Program Challenges</a>
<ul>
<li><a href="#sec-1-1">Tasks</a></li>
<li><a href="#sec-1-2">Free choice</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Assessment Point</a>
<ul>
<li><a href="#sec-2-1">Assessment Point</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class=ribbon>
<a href="https://github.com/stsb11/pic_project">Fork me on GitHub</a>
</div>

<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Program Challenges</h2>
<div class="outline-text-2" id="text-1">
<p>
With our fully working board, we can now write some programs to make perform different tasks for us. Create each of the following programs (they get trickier as you go along), and save each one seperately.
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3 code">
<h3 id="sec-1-1">Tasks</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Program your PCB, so that it&#x2026;
</p>
<ul class="org-ul">
<li>is a metronome. Every second, the LEDs flash on and off for 0.1s to help a pianist keep time while practicing.
</li>
<li>is a disco light. The LEDs flash repeatedly in a pattern. Bonus marks if the pattern changes when the light level drops.
</li>
<li>is a child's nightlight. The LEDs come on when it gets a bit darker than the room you're in.
</li>
<li>is a Survival light. The PCB flashes out SOS in Morse code when the LDR is covered up.
</li>
<li>is an automatic floodlight. The first LED illuminates when it gets a little darker than the room, the second LED as well when it gets darker still, and the third LED when it is very dark.
</li>
<li>is a torch. The LEDs all come on when someone puts their finger on the LDR momentarily, and turns them off again when they "push" the LDR a second time.
</li>
<li>is a toothbrush timer. When triggered by someone passing their hand over the LDR, use the LEDs to indicate to a child when two minutes have elapsed, to help them brush their teeth thoroughly.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 try">
<h3 id="sec-1-2">Free choice</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Create a scenario (like I did in the toothbrush task), and write a program for it.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2 activity">
<h2 id="sec-2"><span class="section-number-2">2</span> Assessment Point</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-sec-2-1" class="outline-3 badge">
<h3 id="sec-2-1">Assessment Point</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>On your portfolio, add (cropped) screenshots of your working programs, and write a few sentences describing how it works.
</li>
<li>On your customised program, explain the scenario briefly, and explain how the code works.
</li>
<li>You can now put your favourite program on it, and take your PCB home. Well done! 
</li>
</ul>
<p>
<a href="index.html">Return to homepage</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
